-- MySQL dump 10.13  Distrib 5.6.25, for Win64 (x86_64)
--
-- Host: localhost    Database: movieinfo_dok
-- ------------------------------------------------------
-- Server version	5.6.25-log

/*!40101 SET @OLD_CHARACTER_SET_CLIENT=@@CHARACTER_SET_CLIENT */;
/*!40101 SET @OLD_CHARACTER_SET_RESULTS=@@CHARACTER_SET_RESULTS */;
/*!40101 SET @OLD_COLLATION_CONNECTION=@@COLLATION_CONNECTION */;
/*!40101 SET NAMES utf8 */;
/*!40103 SET @OLD_TIME_ZONE=@@TIME_ZONE */;
/*!40103 SET TIME_ZONE='+00:00' */;
/*!40014 SET @OLD_UNIQUE_CHECKS=@@UNIQUE_CHECKS, UNIQUE_CHECKS=0 */;
/*!40014 SET @OLD_FOREIGN_KEY_CHECKS=@@FOREIGN_KEY_CHECKS, FOREIGN_KEY_CHECKS=0 */;
/*!40101 SET @OLD_SQL_MODE=@@SQL_MODE, SQL_MODE='NO_AUTO_VALUE_ON_ZERO' */;
/*!40111 SET @OLD_SQL_NOTES=@@SQL_NOTES, SQL_NOTES=0 */;

--
-- Table structure for table `movie`
--

DROP TABLE IF EXISTS `movie`;
/*!40101 SET @saved_cs_client     = @@character_set_client */;
/*!40101 SET character_set_client = utf8 */;
CREATE TABLE `movie` (
  `m_name` varchar(20) DEFAULT NULL,
  `genre` varchar(20) DEFAULT NULL,
  `image` blob,
  `open_day` varchar(20) DEFAULT NULL,
  `audience` int(11) DEFAULT NULL,
  `rating` double DEFAULT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8;
/*!40101 SET character_set_client = @saved_cs_client */;

--
-- Dumping data for table `movie`
--

LOCK TABLES `movie` WRITE;
/*!40000 ALTER TABLE `movie` DISABLE KEYS */;
INSERT INTO `movie` VALUES ('삼진그룹 영어토익반','드라마',NULL,'2020-10-21',540000,9.36),('소리도 없이','드라마',NULL,'2020-10-15',360000,7.97),('담보','드라마',NULL,'2020-09-29',1610000,9.2),('아일랜드','SF',NULL,'2005-07-21',3210000,8.81),('코렐라인: 비밀의 문','애니메이션',NULL,'2009-05-21',210000,9.14),('기생충','드라마',NULL,'2019-05-30',10310000,9.07),('시동','드라마',NULL,'2019-12-18',3310000,8.69),('인터스텔라','SF',NULL,'2014-11-06',10300000,9.12),('검은 사제들','스릴러',NULL,'2015-11-05',5440000,8.55),('사자','스릴러',NULL,'2019-07-31',1610000,7.9),('늑대소년','로맨스',NULL,'2012-10-31',7060000,8.65),('너의 이름은','애니메이션',NULL,'2017-01-04',3730000,9.02),('컨저링','공포',NULL,'2013-09-17',2260000,7.86),('애나벨','공포',NULL,'2019-06-26',480000,7.48),('해리 포터와 마법사의 돌','SF',NULL,'2001-12-14',260000,9.29),('해리 포터와 비밀의 방','SF',NULL,'2002-12-13',130000,8.88),('해리 포터와 아즈카반의 죄수','SF',NULL,'2004-07-16',1830000,8.72),('해리 포터와 불의 잔','SF',NULL,'2005-12-01',3430000,7.69),('해리 포터와 불사조 기사단','SF',NULL,'2007-07-11',3690000,7.01),('해리 포터와 혼혈 왕자','SF',NULL,'2009-07-15',2950000,6.92),('해리 포터와 죽음의 성물 - 1부','SF',NULL,'2010-12-15',2850000,8.2),('해리 포터와 죽음의 성물 - 2부','SF',NULL,'2011-07-13',4420000,9.32),('컨저링 2','공포',NULL,'2016-06-09',1920000,8.34),('겨울 왕국','애니메이션',NULL,'2014-01-16',10300000,9.2),('겨울 왕국 2','애니메이션',NULL,'2019-11-21',13740000,8.95),('인셉션','액션',NULL,'2020-08-12',5990000,9.6),('캡틴 아메리카: 윈터 솔져','액션',NULL,'2014-03-26',3960000,8.83),('어벤져스: 엔드게임','액션',NULL,'2019-04-24',13970000,9.49),('알리타: 배틀 엔젤','액션',NULL,'2019-02-05',1950000,8.82),('하울의 움직이는 성','애니메이션',NULL,'2004-12-23',2610000,9.35),('센과 치히로의 행방불명','애니메이션',NULL,'2002-06-28',150000,9.58),('국제수사','액션',NULL,'2020-09-29',530000,7.26),('부산행','액션',NULL,'2016-07-20',11570000,8.6),('미스 페레그린과 이상한 아이들의 집','SF',NULL,'2016-09-28',2710000,8.58),('알라딘','SF',NULL,'2019-05-23',12720000,9.42),('모아나','애니메이션',NULL,'2017-01-12',2310000,9.22),('라이온 킹','애니메이션',NULL,'1994-07-09',300000,9.29),('오션스8','액션',NULL,'2018-06-13',1330000,8.37),('수어사이드 스쿼드','액션',NULL,'2016-08-03',1890000,7.6),('국제시장','드라마',NULL,'2014-12-17',14260000,9.16),('택시 운전사','드라마',NULL,'2017-08-02',12180000,9.28),('작은 아씨들','드라마',NULL,'2020-02-12',860000,9.13),('파라노말 액티비티','공포',NULL,'2010-01-13',430000,7.46),('파라노말 액티비티 2','공포',NULL,'2010-10-21',350000,6.55),('파라노말 액티비티 3','공포',NULL,'2011-10-20',130000,6.94),('파라노말 액티비티 4','공포',NULL,'2012-10-25',540000,5.02),('파라노말 액티비티: 더 고스트 디멘션','공포',NULL,'2016-04-20',540000,6.46),('숨바꼭질','스릴러',NULL,'2013-08-14',5600000,6.77),('타이타닉','로맨스',NULL,'1998-02-20',420000,9.89),('나의 소녀시대','로맨스',NULL,'2016-05-11',420000,9.36),('라라랜드','로맨스',NULL,'2020-03-25',3730000,8.91),('미 비포 유','로맨스',NULL,'2016-06-01',940000,8.78),('암살','액션',NULL,'2015-07-22',12700000,9.1),('기억의 밤','스릴러',NULL,'2017-11-29',1380000,8.41),('살인의 추억','스릴러',NULL,'2003-04-25',12000,9.65),('어바웃 타임','로맨스',NULL,'2013-12-05',3440000,9.28),('노트북','로맨스',NULL,'2004-11-26',600000,9.47),('건축학개론','로맨스',NULL,'2012-03-22',4110000,8.67),('곡성','스릴러',NULL,'2016-05-12',6870000,8.22),('겟 아웃','스릴러',NULL,'2017-05-17',2140000,8.45),('어스','스릴러',NULL,'2019-03-27',1470000,7.7),('뷰티 인사이드','로맨스',NULL,'2015-08-20',2050000,8.26),('안녕,헤이즐','로맨스',NULL,'2014-08-13',740000,8.48),('모노노케 히메','애니메이션',NULL,'2003-04-25',3950000,9.36),('유전','공포',NULL,'2017-06-07',180000,7.9),('테넷','액션',NULL,'2020-08-26',1940000,8.76),('마녀 배달부 키키','애니메이션','null','2007-11-22',59000,9.45),('나를 찾아줘','스릴러',NULL,'2014-10-23',1760000,8.3),('강철비','드라마',NULL,'2017-12-14',4450000,8.73),('강철비2: 정상회담','드라마',NULL,'2020-07-29',1800000,7.99);
/*!40000 ALTER TABLE `movie` ENABLE KEYS */;
UNLOCK TABLES;
/*!40103 SET TIME_ZONE=@OLD_TIME_ZONE */;

/*!40101 SET SQL_MODE=@OLD_SQL_MODE */;
/*!40014 SET FOREIGN_KEY_CHECKS=@OLD_FOREIGN_KEY_CHECKS */;
/*!40014 SET UNIQUE_CHECKS=@OLD_UNIQUE_CHECKS */;
/*!40101 SET CHARACTER_SET_CLIENT=@OLD_CHARACTER_SET_CLIENT */;
/*!40101 SET CHARACTER_SET_RESULTS=@OLD_CHARACTER_SET_RESULTS */;
/*!40101 SET COLLATION_CONNECTION=@OLD_COLLATION_CONNECTION */;
/*!40111 SET SQL_NOTES=@OLD_SQL_NOTES */;

-- Dump completed on 2020-10-30 23:59:07
